import numpy as np
from functools import reduce
import operator
from matplotlib import pyplot as plt


def compute_quality():
    """
    Расчет среднего эмпирического риска Q, т.е. среднего от loss о всей обучающей выборке
    """
    np.random.seed(0)  # псевдослучайные числа образуют одну и ту же последовательность (при каждом запуске)
    x = np.arange(-1.0, 1.0, 0.1)  # аргумент [-1; 1] с шагом 0,1
    w = [0.5, -0.3]  # коэффициенты модели

    model = lambda x, w: (w[0] + w[1] * x)  # модель

    loss = lambda ax, y: (ax - y) ** 2  # квадратическая функция потерь

    y = model(x, w) + np.random.normal(0, 0.1, len(x))  # вектор целевых значений

    # Вычисляем значение среднего эмпирического риска
    Q = reduce(operator.add, loss(model(x, w), y)) / len(x)
    print(Q)


def compute_weights1():
    """
    Расчет весов модели методом наименьших квадратов
    """
    np.random.seed(0)  # псевдослучайные числа образуют одну и ту же последовательность (при каждом запуске)
    x = np.arange(-1.0, 1.0, 0.1)  # аргумент [-1; 1] с шагом 0,1

    model = lambda x, w: (w[0] + w[1] * x)  # модель

    y = model(x, [-5.2, 0.7]) + np.random.normal(0, 0.1, len(x))  # вектор целевых значений

    # Дифференцируем функцию расчета среднего эмпирического риска (Q) при квадратичной функции потерь (loss) по вектору весов (w).
    # T.e dQ/dw и приравниваем эту производную к 0 для получения формулы расчета w
    x = np.array([[1, xi] for xi in x])
    w = np.linalg.inv(x.T @ x) @ x.T @ y

    # тот же расчет методом наименьших квадратов на пальцах
    # https://www.youtube.com/watch?v=8sVfWyQrMiM
    # mx = np.sum(x) / len(x)
    # my = np.sum(y) / len(x)
    # a2 = np.dot(x.T, x) / len(x)
    # a11 = np.dot(x.T, y) / len(x)
    # k = (a11 - mx * my) / (a2 - mx ** 2)
    # b = my - k * mx
    # w = np.array([b, k])

    print(w)


def compute_weights2():
    """
    Расчет весов модели методом наименьших квадратов
    """
    np.random.seed(0)  # псевдослучайные числа образуют одну и ту же последовательность (при каждом запуске)
    x = np.arange(-1.0, 1.0, 0.1)  # аргумент [-1; 1] с шагом 0,1

    model = lambda x, w: (w[0] + w[1] * x + w[2] * x ** 2 + w[3] * x ** 3)  # модель
    y = np.sin(x * 5) + 2 * x + np.random.normal(0, 0.1, len(x))  # вектор целевых значений

    x = np.array([[1, xi, xi ** 2, xi ** 3] for xi in x])  # обучающая выборка для поиска коэффициентов w модели a
    w = np.linalg.inv(x.T @ x) @ x.T @ y

    print(w)


def binary_classification():
    """
    https://stepik.org/lesson/1370053/step/8?unit=1386243
    Классификация точек на двумерном пространстве через трехмерную линейную модель
    где первый вес w[0] нужен для того чтобы прямая проходила через начало координат
    """
    x_test = [(5, -3), (-3, 8), (3, 6), (0, 0), (5, 3), (-3, -1),
              (-3, 3)]  # точки для которых нужно определить класс в двумерном пространстве
    w = [2.5, -0.68, -0.98]  # коэффициенты модели

    x_test_3d = [(1, xi[0], xi[1]) for xi in x_test]  # переносим точки в трехмерное пространство

    predict = [int(np.sign(np.array(w).T @ np.array(xi))) for xi in x_test_3d]
    print(predict)


def compute_margin():
    """
    Расчет расстояния точек от разделяющей гиперплоскости
    """
    w = np.array([15 / 7, -9 / 7, -1])
    x_test = [[1, -8, -4], [1, -2, 2], [1, 4, 8], [1, 6, 3]]  # точки для которых нужно рассчитать расстояния
    y_test = [1, 1, -1, -1]

    model = lambda x: w[0] + w[1] * x[1] + w[2] * x[2]

    margin = [model(xi) * yi for xi, yi in zip(x_test, y_test)]
    print(margin)


def compute_quality1():
    """
    Расчет показателя качества для линейной модели классификации путем подсчета количества неправильных классификаций
    """
    w = np.array([-8 / 3, -2 / 3, 1])
    x_test = np.array([(-5, 2), (-4, 6), (3, 2), (3, -3), (5, 5), (5, 2), (-1, 3)])
    y_test = np.array([1, 1, 1, -1, -1, -1, -1])

    x_test_3d = np.array([(1, *xi) for xi in x_test])

    model = lambda w, x: w.T @ x

    Q = reduce(operator.add, [0 if (model(w, xi) * yi * -1) < 0 else 1 for xi, yi in zip(x_test_3d, y_test)])
    print(Q)


def compute_quality2():
    """
    Расчет показателя качества между некоторой функции func и полиномиальной модели ее имитирующей путем расчета квадратичной ошибки
    """

    def func(x):
        return 0.1 * x ** 2 - np.sin(x) + 0.1 * np.cos(x * 5) + 1.

    def loss(predicted, actual):
        return (predicted - actual) ** 2

    def model(x):
        return 1.11 + -0.26 * x + 0.061 * x ** 2 + 0.0226 * x ** 3 + 0.00178 * x ** 4

    coord_x = np.arange(-5.0, 5.0, 0.1)  # значения отсчетов по оси абсцисс

    Q = np.sum([loss(model(x), func(x)) for x in coord_x]) / len(coord_x)
    print(Q)


def compute_weights3():
    """
    Расчет весов модели методом наименьших квадратов с использованием квадратичной функции потерь
    """
    data_x = [(5.8, 1.2), (5.6, 1.5), (6.5, 1.5), (6.1, 1.3), (6.4, 1.3), (7.7, 2.0), (6.0, 1.8), (5.6, 1.3),
              (6.0, 1.6), (5.8, 1.9), (5.7, 2.0), (6.3, 1.5), (6.2, 1.8), (7.7, 2.3), (5.8, 1.2), (6.3, 1.8),
              (6.0, 1.0), (6.2, 1.3), (5.7, 1.3), (6.3, 1.9), (6.7, 2.5), (5.5, 1.2), (4.9, 1.0), (6.1, 1.4),
              (6.0, 1.6), (7.2, 2.5), (7.3, 1.8), (6.6, 1.4), (5.6, 2.0), (5.5, 1.0), (6.4, 2.2), (5.6, 1.3),
              (6.6, 1.3), (6.9, 2.1), (6.8, 2.1), (5.7, 1.3), (7.0, 1.4), (6.1, 1.4), (6.1, 1.8), (6.7, 1.7),
              (6.0, 1.5), (6.5, 1.8), (6.4, 1.5), (6.9, 1.5), (5.6, 1.3), (6.7, 1.4), (5.8, 1.9), (6.3, 1.3),
              (6.7, 2.1), (6.2, 2.3), (6.3, 2.4), (6.7, 1.8), (6.4, 2.3), (6.2, 1.5), (6.1, 1.4), (7.1, 2.1),
              (5.7, 1.0), (6.8, 1.4), (6.8, 2.3), (5.1, 1.1), (4.9, 1.7), (5.9, 1.8), (7.4, 1.9), (6.5, 2.0),
              (6.7, 1.5), (6.5, 2.0), (5.8, 1.0), (6.4, 2.1), (7.6, 2.1), (5.8, 2.4), (7.7, 2.2), (6.3, 1.5),
              (5.0, 1.0), (6.3, 1.6), (7.7, 2.3), (6.4, 1.9), (6.5, 2.2), (5.7, 1.2), (6.9, 2.3), (5.7, 1.3),
              (6.1, 1.2), (5.4, 1.5), (5.2, 1.4), (6.7, 2.3), (7.9, 2.0), (5.6, 1.1), (7.2, 1.8), (5.5, 1.3),
              (7.2, 1.6), (6.3, 2.5), (6.3, 1.8), (6.7, 2.4), (5.0, 1.0), (6.4, 1.8), (6.9, 2.3), (5.5, 1.3),
              (5.5, 1.1), (5.9, 1.5), (6.0, 1.5), (5.9, 1.8)]
    data_y = [-1, -1, -1, -1, -1, 1, 1, -1, -1, 1, 1, -1, 1, 1, -1, 1, -1, -1, -1, 1, 1, -1, -1, -1, -1, 1, 1, -1, 1,
              -1, 1, -1, -1, 1, 1, -1, -1, 1, 1, -1, 1, 1, -1, -1, -1, -1, 1, -1, 1, 1, 1, 1, 1, -1, -1, 1, -1, -1, 1,
              -1, 1, -1, 1, 1, -1, 1, -1, 1, 1, 1, 1, 1, -1, -1, 1, 1, 1, -1, 1, -1, -1, -1, -1, 1, 1, -1, 1, -1, 1, 1,
              1, 1, -1, 1, 1, -1, -1, -1, -1, 1]

    x = np.array([[1, x[0], x[1]] for x in data_x])
    y = np.array(data_y)

    # Умножение матриц (np.dot() или @) заменяет одноименное перемножение компонент и итоговое сложение
    w = (x.T @ y) @ (np.linalg.inv(x.T @ x))

    # line_x = [xi[0] for xi in x]
    # line_y = [-xi*w[1] / w[2]- w[0] for xi in x]
    #
    # x_0 = x[y == 1]
    # x_1 = x[y == -1]
    #
    # plt.scatter(x_0[:, 1], x_0[:, 2], color='red')
    # # plt.scatter(x_0[:, 0], x_0[:, 1], color='red')
    # plt.scatter(x_1[:, 1], x_1[:, 2], color='blue')
    # # plt.scatter(x_1[:, 0], x_1[:, 1], color='blue')
    # plt.plot(line_x, line_y, color='green')
    # plt.show()

if __name__ == "__main__":
    # compute_quality()
    # compute_weights1()
    # compute_weights2()
    # binary_classification()
    # compute_margin()
    # compute_quality1()
    # compute_quality2()
    compute_weights3()
